examples/ahmedBody/openHFDIBRANS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{ 
 	 version 	 2.0; 
 	 format 	 ascii;
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 	1.0;

vertices 
( 
	 ( -0.3 -0.4 0.0 )	// 000
	 ( 1.5 -0.4 0.0 )	// 001
	 ( 1.5 0.4 0.0 )	// 002
	 ( -0.3 0.4 0.0 )	// 003
	 ( -0.3 -0.4 0.6 )	// 004
	 ( 1.5 -0.4 0.6 )	// 005
	 ( 1.5 0.4 0.6 )	// 006
	 ( -0.3 0.4 0.6 )	// 007
	 ( -0.3 -0.4 2.1 )	// 008
	 ( 1.5 -0.4 2.1 )	// 009
	 ( 1.5 0.4 2.1 )	// 010
	 ( -0.3 0.4 2.1 )	// 011
	 ( -2.0 -0.4 0.0 )	// 012
	 ( -2.0 0.4 0.0 )	// 013
	 ( -2.0 -0.4 0.6 )	// 014
	 ( -2.0 0.4 0.6 )	// 015
	 ( 4.0 -0.4 0.0 )	// 016
	 ( 4.0 0.4 0.0 )	// 017
	 ( 4.0 -0.4 0.6 )	// 018
	 ( 4.0 0.4 0.6 )	// 019
	 ( -2.0 -0.4 2.1 )	// 020
	 ( -2.0 0.4 2.1 )	// 021
	 ( 4.0 -0.4 2.1 )	// 022
	 ( 4.0 0.4 2.1 )	// 023
	 ( -0.3 -2.0 0.0 )	// 024
	 ( 1.5 -2.0 0.0 )	// 025
	 ( -0.3 -2.0 0.6 )	// 026
	 ( 1.5 -2.0 0.6 )	// 027
	 ( -0.3 -2.0 2.1 )	// 028
	 ( 1.5 -2.0 2.1 )	// 029
	 ( -2.0 -2.0 0.0 )	// 030
	 ( -2.0 -2.0 0.6 )	// 031
	 ( 4.0 -2.0 0.0 )	// 032
	 ( 4.0 -2.0 0.6 )	// 033
	 ( -2.0 -2.0 2.1 )	// 034
	 ( 4.0 -2.0 2.1 )	// 035
	 ( 1.5 2.0 0.0 )	// 036
	 ( -0.3 2.0 0.0 )	// 037
	 ( 1.5 2.0 0.6 )	// 038
	 ( -0.3 2.0 0.6 )	// 039
	 ( 1.5 2.0 2.1 )	// 040
	 ( -0.3 2.0 2.1 )	// 041
	 ( -2.0 2.0 0.0 )	// 042
	 ( -2.0 2.0 0.6 )	// 043
	 ( 4.0 2.0 0.0 )	// 044
	 ( 4.0 2.0 0.6 )	// 045
	 ( -2.0 2.0 2.1 )	// 046
	 ( 4.0 2.0 2.1 )	// 047
); 

edges 
( 
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	lambdaZone	( 257  114  86)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 4  5  6  7  8  9  10  11)	( 257  114  30)	simpleGrading 	( 1.0  1.0  20)

	hex
		( 12  0  3  13  14  4  7  15)	( 34  114  86)	simpleGrading 	( 0.05  1.0  1.0)

	hex
		( 1  16  17  2  5  18  19  6)	( 51  114  86)	simpleGrading 	( 20  1.0  1.0)

	hex
		( 14  4  7  15  20  8  11  21)	( 34  114  30)	simpleGrading 	( 0.05  1.0  20)

	hex
		( 5  18  19  6  9  22  23  10)	( 51  114  30)	simpleGrading 	( 20  1.0  20)

	hex
		( 24  25  1  0  26  27  5  4)	( 257  32  86)	simpleGrading 	( 1.0  0.05  1.0)

	hex
		( 26  27  5  4  28  29  9  8)	( 257  32  30)	simpleGrading 	( 1.0  0.05  20)

	hex
		( 30  24  0  12  31  26  4  14)	( 34  32  86)	simpleGrading 	( 0.05  0.05  1.0)

	hex
		( 25  32  16  1  27  33  18  5)	( 51  32  86)	simpleGrading 	( 20  0.05  1.0)

	hex
		( 31  26  4  14  34  28  8  20)	( 34  32  30)	simpleGrading 	( 0.05  0.05  20)

	hex
		( 27  33  18  5  29  35  22  9)	( 51  32  30)	simpleGrading 	( 20  0.05  20)

	hex
		( 3  2  36  37  7  6  38  39)	( 257  32  86)	simpleGrading 	( 1.0  20  1.0)

	hex
		( 7  6  38  39  11  10  40  41)	( 257  32  30)	simpleGrading 	( 1.0  20  20)

	hex
		( 13  3  37  42  15  7  39  43)	( 34  32  86)	simpleGrading 	( 0.05  20  1.0)

	hex
		( 2  17  44  36  6  19  45  38)	( 51  32  86)	simpleGrading 	( 20  20  1.0)

	hex
		( 15  7  39  43  21  11  41  46)	( 34  32  30)	simpleGrading 	( 0.05  20  20)

	hex
		( 6  19  45  38  10  23  47  40)	( 51  32  30)	simpleGrading 	( 20  20  20)

); 

boundary 
( 
	frontAndBack
	{
		type patch;
		faces
		(
			( 24  25  27  26)
			( 26  27  29  28)
			( 30  24  26  31)
			( 25  32  33  27)
			( 31  26  28  34)
			( 27  33  35  29)
			( 37  36  38  39)
			( 39  38  40  41)
			( 42  37  39  43)
			( 36  44  45  38)
			( 43  39  41  46)
			( 38  45  47  40)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 12  13  15  14)
			( 14  15  21  20)
			( 30  12  14  31)
			( 13  42  43  15)
			( 31  14  20  34)
			( 15  43  46  21)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 16  17  19  18)
			( 18  19  23  22)
			( 32  16  18  33)
			( 17  44  45  19)
			( 33  18  22  35)
			( 19  45  47  23)
		);
	}

	lowerWall
	{
		type wall;
		faces
		(
			( 0  1  2  3)
			( 12  0  3  13)
			( 1  16  17  2)
			( 24  25  1  0)
			( 30  24  0  12)
			( 25  32  16  1)
			( 3  2  36  37)
			( 13  3  37  42)
			( 2  17  44  36)
		);
	}

	upperWall
	{
		type patch;
		faces
		(
			( 8  9  10  11)
			( 20  8  11  21)
			( 9  22  23  10)
			( 28  29  9  8)
			( 11  10  40  41)
			( 34  28  8  20)
			( 21  11  41  46)
			( 29  35  22  9)
			( 10  23  47  40)
		);
	}

); 

mergePatchPairs 
( 
); 

