examples/ahmedBody/openHFDIBRANS/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceThreshold    1e-4;
sdBasedLambda       false;
stlName             ahmedBody;
interfaceSpan       1.0;
saveIntInfo         false;
surfAreaType        cutEdges;

wallFunctions
{
    nut		nutkWallFunction;
    k		kLowReWallFunction;
    omega	omegaWallFunction;
    epsilon	epsilonWallFunction;
}

// ************************************************************************* //
