examples/ahmedBody/openHFDIBRANS/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.78e+0;

boundaryField
{
    frontAndBack
    {
        type            calculated;
        value           $internalField;
    }

    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    lowerWall
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    upperWall
    {
        type            calculated;
        value           $internalField;
    }

    ahmed_bodyGroup
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    wallInsideLambda
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
